package classwork.class5.Task10_2;

import java.util.ArrayList;
import java.util.List;

/**
 * К сожалению, JDK не содержит итератора для массива, который можно было бы использовать. Создайте итератор, который может проходить массив строк
 */
public class Task10_2 {
    String str = "Для облегчения работы с ошибками, большинство современных языков имеют механизм исключений. " +
            "Исключительным состоянием назы-вается состояние программы, когда она не может продолжать выполнение данного " +
            "фрагмента кода, и необходимо передать управление фрагменту, который может выполнить необходимые в данном случае действия.";

    List<String> arrayList = new ArrayList<String>();
}





